ch10/ch10-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-10 Thu 03:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 10.1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 10.1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1ec26a9">ch10.1</a>
<ul>
<li><a href="#orgc9d14e8">10.1-1</a></li>
<li><a href="#org34a5a37">10.1-2</a></li>
<li><a href="#org7c7936d">10.1-3</a></li>
<li><a href="#org9e9cf7b">10.1-4</a></li>
<li><a href="#orgc9bc17c">10.1-5</a></li>
<li><a href="#orgf22a139">10.1-6</a></li>
<li><a href="#org4ef39c2">10.1-7</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1ec26a9" class="outline-2">
<h2 id="org1ec26a9">ch10.1</h2>
<div class="outline-text-2" id="text-org1ec26a9">
</div>
<div id="outline-container-orgc9d14e8" class="outline-3">
<h3 id="orgc9d14e8">10.1-1</h3>
<div class="outline-text-3" id="text-orgc9d14e8">
<pre class="example">
Initially empty stack S
|-------+---+---+---+---+---+---|
| S     | 1 | 2 | 3 | 4 | 5 | 6 |
|-------+---+---+---+---+---+---|
| top=0 |   |   |   |   |   |   |
|-------+---+---+---+---+---+---|

PUSH(S, 4)
|-------+---+---+---+---+---+---|
| S     | 1 | 2 | 3 | 4 | 5 | 6 |
|-------+---+---+---+---+---+---|
| top=1 | 4 |   |   |   |   |   |
|-------+---+---+---+---+---+---|

PUSH(S, 1)
|-------+---+---+---+---+---+---|
| S     | 1 | 2 | 3 | 4 | 5 | 6 |
|-------+---+---+---+---+---+---|
| top=2 | 4 | 1 |   |   |   |   |
|-------+---+---+---+---+---+---|

PUSH(S, 3)
|-------+---+---+---+---+---+---|
| S     | 1 | 2 | 3 | 4 | 5 | 6 |
|-------+---+---+---+---+---+---|
| top=3 | 4 | 1 | 3 |   |   |   |
|-------+---+---+---+---+---+---|

POP(S) -&gt; 3
|-------+---+---+---+---+---+---|
| S     | 1 | 2 | 3 | 4 | 5 | 6 |
|-------+---+---+---+---+---+---|
| top=2 | 4 | 1 | 3 |   |   |   |
|-------+---+---+---+---+---+---|

PUSH(S, 8)
|-------+---+---+---+---+---+---|
| S     | 1 | 2 | 3 | 4 | 5 | 6 |
|-------+---+---+---+---+---+---|
| top=3 | 4 | 1 | 8 |   |   |   |
|-------+---+---+---+---+---+---|

POP(S) -&gt; 8
|-------+---+---+---+---+---+---|
| S     | 1 | 2 | 3 | 4 | 5 | 6 |
|-------+---+---+---+---+---+---|
| top=2 | 4 | 1 | 8 |   |   |   |
|-------+---+---+---+---+---+---|
</pre>
</div>
</div>
<div id="outline-container-org34a5a37" class="outline-3">
<h3 id="org34a5a37">10.1-2</h3>
<div class="outline-text-3" id="text-org34a5a37">
<p>
We could store the elements of one stack from A[1] up to A[n], and store the
elements of another stack from A[n] down to A[1].
</p>
</div>
</div>
<div id="outline-container-org7c7936d" class="outline-3">
<h3 id="org7c7936d">10.1-3</h3>
<div class="outline-text-3" id="text-org7c7936d">
<pre class="example">
Initially empty queue Q
|---------------+---+---+---+---+---+---|
| Q             | 1 | 2 | 3 | 4 | 5 | 6 |
|---------------+---+---+---+---+---+---|
| head=1 tail=1 |   |   |   |   |   |   |
|---------------+---+---+---+---+---+---|

ENQUEUE(Q, 4)
|---------------+---+---+---+---+---+---|
| Q             | 1 | 2 | 3 | 4 | 5 | 6 |
|---------------+---+---+---+---+---+---|
| head=1 tail=2 | 4 |   |   |   |   |   |
|---------------+---+---+---+---+---+---|

ENQUEUE(Q, 1)
|---------------+---+---+---+---+---+---|
| Q             | 1 | 2 | 3 | 4 | 5 | 6 |
|---------------+---+---+---+---+---+---|
| head=1 tail=3 | 4 | 1 |   |   |   |   |
|---------------+---+---+---+---+---+---|

ENQUEUE(Q, 3)
|---------------+---+---+---+---+---+---|
| Q             | 1 | 2 | 3 | 4 | 5 | 6 |
|---------------+---+---+---+---+---+---|
| head=1 tail=4 | 4 | 1 | 3 |   |   |   |
|---------------+---+---+---+---+---+---|

DEQUEUE(Q) -&gt; 4
|---------------+---+---+---+---+---+---|
| Q             | 1 | 2 | 3 | 4 | 5 | 6 |
|---------------+---+---+---+---+---+---|
| head=2 tail=4 | 4 | 1 | 3 |   |   |   |
|---------------+---+---+---+---+---+---|

ENQUEUE(Q, 8)
|---------------+---+---+---+---+---+---|
| Q             | 1 | 2 | 3 | 4 | 5 | 6 |
|---------------+---+---+---+---+---+---|
| head=2 tail=5 | 4 | 1 | 3 | 8 |   |   |
|---------------+---+---+---+---+---+---|

DEQUEUE(Q) -&gt; 1
|---------------+---+---+---+---+---+---|
| Q             | 1 | 2 | 3 | 4 | 5 | 6 |
|---------------+---+---+---+---+---+---|
| head=3 tail=5 | 4 | 1 | 3 | 8 |   |   |
|---------------+---+---+---+---+---+---|
</pre>
</div>
</div>
<div id="outline-container-org9e9cf7b" class="outline-3">
<h3 id="org9e9cf7b">10.1-4</h3>
<div class="outline-text-3" id="text-org9e9cf7b">
<pre class="example">
QUEUE-EMPTY?(Q)
    return Q.head == Q.tail

QUEUE-FULL?(Q)
    if Q.head == 1
	return Q.tail == Q.length
    return Q.head == Q.tail + 1

ENQUEUE(Q, x)
    if QUEUE-FULL?(Q)
	error "the queue overflows"
    Q[Q.tail] = x
    if Q[Q.tail] == Q.length
	Q.tail = 1
    else Q.tail = Q.tail + 1

DEQUEUE(Q)
    if QUEUE-EMPTY?(Q)
	error "the queue underflows"
    x = Q[Q.head]
    if Q.head == Q.length
	Q.head = 1
    else Q.head = Q.head + 1
    return x
</pre>
</div>
</div>
<div id="outline-container-orgc9bc17c" class="outline-3">
<h3 id="orgc9bc17c">10.1-5</h3>
<div class="outline-text-3" id="text-orgc9bc17c">
<p>
The <code>ENQUEUE</code> and <code>DEQUEUE</code> operations of deque are same as those of queue.
</p>
<pre class="example">
ENQUEUE-COUNTER(Q, x)
    if QUEUE-FULL?(Q)
	error "the queue overflows"
    if Q.head == 1
	Q.head = Q.length
    else Q.head = Q.head - 1
    Q[Q.head] = x

DEQUEUE-COUNTER(Q)
    if QUEUE-EMPTY?(Q)
	error "the queue underflows"
    if Q.tail == 1
	Q.tail = Q.length
    else Q.tail = Q.tail - 1
    return Q[Q.tail]
</pre>
</div>
</div>
<div id="outline-container-orgf22a139" class="outline-3">
<h3 id="orgf22a139">10.1-6</h3>
<div class="outline-text-3" id="text-orgf22a139">
<p>
Assume the queue <code>Q</code> has two internal stacks <code>Q.S1</code> and <code>Q.S2</code>.
</p>
<pre class="example">
ENQUEUE(Q, x)
    PUSH(Q.S1, x)

DEQUEUE(Q)
    if STACK-EMPTY(Q.S2)
	if STACK-EMPTY?(Q.S1)
	    error "the queue underflows"
	else while not STACK-EMPTY?(Q.S1)
		 PUSH(Q.S2, POP(Q.S1))
    return POP(Q.S2)
</pre>
<p>
The <code>ENQUEUE</code> operation takes \(O(1)\) running time, the <code>DEQUEUE</code> operation
takes \(O(n)\) worst-case running time and \(O(1)\) running time on average.
</p>
</div>
</div>
<div id="outline-container-org4ef39c2" class="outline-3">
<h3 id="org4ef39c2">10.1-7</h3>
<div class="outline-text-3" id="text-org4ef39c2">
<p>
Assume the stack <code>S</code> has two internal queues <code>S.Q1</code> and <code>S.Q2</code>, and the queue
supports <code>QUEUE-EMPTY?</code> operation.
</p>
<pre class="example">
PUSH(S, x)
    if QUEUE-FULL?(S.Q1)
	error "the stack overflows"
    ENQUEUE(S.Q1)

POP(S)
    if QUEUE-EMPTY?(S.Q1)
	error "the stack underflows"
    while not QUEUE-EMPTY(S.Q1)
	x = DEQUEUE(S.Q1)
	ENQUEUE(S.Q2, x)
    Q = S.Q1
    S.Q1 = S.Q2
    S.Q2 = Q
    return x
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2020-09-10 Thu 03:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
